**å¤ä¹ ï¼š**æ•°æ®åˆ†æçš„ç¬¬ä¸€æ­¥ï¼ŒåŠ è½½æ•°æ®æˆ‘ä»¬å·²ç»å­¦ä¹ å®Œæ¯•äº†ã€‚å½“æ•°æ®å±•ç°åœ¨æˆ‘ä»¬é¢å‰çš„æ—¶å€™ï¼Œæˆ‘ä»¬æ‰€è¦åšçš„ç¬¬ä¸€æ­¥å°±æ˜¯è®¤è¯†ä»–ï¼Œä»Šå¤©æˆ‘ä»¬è¦å­¦ä¹ çš„å°±æ˜¯**äº†è§£å­—æ®µå«ä¹‰ä»¥åŠåˆæ­¥è§‚å¯Ÿæ•°æ®**ã€‚

## 1 ç¬¬ä¸€ç« ï¼šæ•°æ®è½½å…¥åŠåˆæ­¥è§‚å¯Ÿ

### 1.4 çŸ¥é“ä½ çš„æ•°æ®å«ä»€ä¹ˆ
Series:ä¸€ç»´æ•°ç»„ï¼Œå€¼valueå’Œç´¢å¼•index
DataFrame:è¡¨ç¤ºçš„æ˜¯çŸ©é˜µçš„æ•°æ®è¡¨ï¼Œå®ƒæ˜¯å·²æ’åˆ—çš„åˆ—é›†åˆï¼Œæ¯ä¸€åˆ—å¯ä»¥æ˜¯ä¸åŒçš„å€¼ç±»å‹ã€‚æ—¢æœ‰è¡Œç´¢å¼•ä¹Ÿæœ‰åˆ—ç´¢å¼•ã€‚

**å¼€å§‹å‰å¯¼å…¥numpyå’Œpandas**

In [25]:
import numpy as np
import pandas as pd

#### 1.4.1 ä»»åŠ¡ä¸€ï¼špandasä¸­æœ‰ä¸¤ä¸ªæ•°æ®ç±»å‹DateFrameå’ŒSeriesï¼Œé€šè¿‡æŸ¥æ‰¾ç®€å•äº†è§£ä»–ä»¬ã€‚ç„¶åè‡ªå·±å†™ä¸€ä¸ªå…³äºè¿™ä¸¤ä¸ªæ•°æ®ç±»å‹çš„å°ä¾‹å­ğŸŒ°[å¼€æ”¾é¢˜]

In [8]:
#Seriesä¸¾ä¾‹
import numpy as np
import pandas as pd

#Serieså­—å…¸åˆ›å»º
sdata={'math':200,'english':100,'manage':300}
obj1=pd.Series(sdata)
obj1

#æŸ¥æ‰¾æ•°å­¦å’Œè‹±è¯­çš„æˆç»©
obj1[['math','english']]

math       200
english    100
dtype: int64

In [14]:
#DataFrameä¸¾ä¾‹
import numpy as np
import pandas as pd

#åˆ›å»ºèº«é«˜å¯¹æ¯”
data={'name':['Kang','Kang','Kang','Shi','Shi','Shi'],
     'year':[2004,2005,2006,2004,2005,2006],
     'height':[1.26,1.27,1.33,1.32,1.36,1.42]}
frame=pd.DataFrame(data)
frame

#æŒ‰ç…§å­—å…¸å½¢æ ‡è®°æˆ–è€…å±æ€§é‚£æ ·æ£€ç´¢ä¸ºSeries
frame['height']  #å¯¹äºä»»ä½•åˆ—åéƒ½æœ‰æ•ˆ
frame.year   #å¯¹äºåˆ—åæ˜¯æœ‰æ•ˆpyå˜é‡æ—¶å€™æœ‰æ•ˆ

0    2004
1    2005
2    2006
3    2004
4    2005
5    2006
Name: year, dtype: int64

#### 1.4.2 ä»»åŠ¡äºŒï¼šæ ¹æ®ä¸ŠèŠ‚è¯¾çš„æ–¹æ³•è½½å…¥"train.csv"æ–‡ä»¶

In [15]:
df=pd.read_csv('D:/study/python/data/hands-on-data-analysis-master/ç¬¬ä¸€å•å…ƒé¡¹ç›®é›†åˆ/train.csv')
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S


#### 1.4.3 ä»»åŠ¡ä¸‰ï¼šæŸ¥çœ‹DataFrameæ•°æ®çš„æ¯åˆ—çš„åç§°

In [17]:

df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

#### 1.4.4ä»»åŠ¡å››ï¼šæŸ¥çœ‹"Cabin"è¿™åˆ—çš„æ‰€æœ‰å€¼[æœ‰å¤šç§æ–¹æ³•]

In [21]:
df['Cabin'].head(5)

0     NaN
1     C85
2     NaN
3    C123
4     NaN
Name: Cabin, dtype: object

In [29]:
df.Cabin.head(3)

#### 1.4.5 ä»»åŠ¡äº”ï¼šåŠ è½½æ–‡ä»¶"test_1.csv"ï¼Œç„¶åå¯¹æ¯”"train.csv"ï¼Œçœ‹çœ‹æœ‰å“ªäº›å¤šå‡ºçš„åˆ—ï¼Œç„¶åå°†å¤šå‡ºçš„åˆ—åˆ é™¤
ç»è¿‡æˆ‘ä»¬çš„è§‚å¯Ÿå‘ç°ä¸€ä¸ªæµ‹è¯•é›†test_1.csvæœ‰ä¸€åˆ—æ˜¯å¤šä½™çš„ï¼Œæˆ‘ä»¬éœ€è¦å°†è¿™ä¸ªå¤šä½™çš„åˆ—åˆ å»

In [24]:
df2=pd.read_csv('D:/study/python/data/hands-on-data-analysis-master/ç¬¬ä¸€å•å…ƒé¡¹ç›®é›†åˆ/test_1.csv')
df2.columns

Index(['Unnamed: 0', 'PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age',
       'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'a'],
      dtype='object')

In [25]:
#å¯¹æ¯”å‘ç°å¤šäº†ä¸ªaåˆ—ï¼Œè¿›è¡Œåˆ é™¤
del df2['a']
df2.columns

Index(['Unnamed: 0', 'PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age',
       'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

ã€æ€è€ƒã€‘è¿˜æœ‰å…¶ä»–çš„åˆ é™¤å¤šä½™çš„åˆ—çš„æ–¹å¼å—ï¼Ÿ

In [32]:
# ä½¿ç”¨dropè¿›è¡Œåˆ é™¤,axisä¸º0æ—¶è¡¨ç¤ºåˆ é™¤è¡Œï¼Œaxisä¸º1æ—¶è¡¨ç¤ºåˆ é™¤åˆ—ï¼Œè¿˜æ˜¯ä¸€æ ·
#errors='raise'ä¼šè®©ç¨‹åºåœ¨labelsæ¥æ”¶åˆ°æ²¡æœ‰çš„è¡Œåæˆ–è€…åˆ—åæ—¶æŠ›å‡ºé”™è¯¯å¯¼è‡´ç¨‹åºåœæ­¢è¿è¡Œï¼Œerrors='ignore'ä¼šå¿½ç•¥æ²¡æœ‰çš„è¡Œåæˆ–è€…åˆ—åï¼Œåªå¯¹å­˜åœ¨çš„è¡Œåæˆ–è€…åˆ—åè¿›è¡Œæ“ä½œï¼Œæ²¡æœ‰æŒ‡å®šçš„è¯ä¹Ÿæ˜¯é»˜è®¤â€˜errors='raise'â€™
#inplaceå‚æ•°Falseè¡¨ç¤ºå¯¹åŸæ•°æ®ä¸ç”Ÿæ•ˆï¼ŒTruthè¡¨ç¤ºç”Ÿæ•ˆ
df2.drop(['Fare'],axis=1,inplace=True)
df2.columns

Index(['Unnamed: 0', 'PassengerId', 'Survived', 'Pclass', 'Name', 'Sex',
       'SibSp', 'Parch', 'Cabin', 'Embarked'],
      dtype='object')

#### 1.4.6 ä»»åŠ¡å…­ï¼š å°†['PassengerId','Name','Age','Ticket']è¿™å‡ ä¸ªåˆ—å…ƒç´ éšè—ï¼Œåªè§‚å¯Ÿå…¶ä»–å‡ ä¸ªåˆ—å…ƒç´

In [34]:
df2.drop(['PassengerId','Name','Age','Ticket'],axis=1,errors='ignore')
df2.columns

Index(['Unnamed: 0', 'PassengerId', 'Survived', 'Pclass', 'Name', 'Sex',
       'SibSp', 'Parch', 'Cabin', 'Embarked'],
      dtype='object')

ã€æ€è€ƒå›ç­”ã€‘

å¦‚æœæƒ³è¦å®Œå…¨çš„åˆ é™¤ä½ çš„æ•°æ®ç»“æ„ï¼Œä½¿ç”¨inplace=Trueï¼Œå› ä¸ºä½¿ç”¨inplaceå°±å°†åŸæ•°æ®è¦†ç›–äº†ï¼Œæ‰€ä»¥è¿™é‡Œæ²¡æœ‰ç”¨

åœ¨åˆ é™¤äº†ä¸€äº›ç´¢å¼•åï¼Œå¯èƒ½ä¼šå¯¼è‡´åŸæœ‰ç´¢å¼•ä¸¢å¤±ï¼Œè°ƒå–ä¸æ–¹ä¾¿ï¼Œå¯ä»¥ä½¿ç”¨reset_indexé‡ç½®ç´¢å¼•åœ¨è·å¾—æ–°çš„indexï¼ŒåŸæ¥çš„indexå˜æˆæ•°æ®åˆ—ï¼Œä¿ç•™åœ¨æ•°æ®æ¡†ä¸­ï¼Œä¸æƒ³ä¿ç•™åŸæ¥çš„indexçš„è¯å¯ä»¥ä½¿ç”¨å‚æ•°drop=Trueï¼Œé»˜è®¤Falseã€‚

### 1.5 ç­›é€‰çš„é€»è¾‘

è¡¨æ ¼æ•°æ®ä¸­ï¼Œæœ€é‡è¦çš„ä¸€ä¸ªåŠŸèƒ½å°±æ˜¯è¦å…·æœ‰å¯ç­›é€‰çš„èƒ½åŠ›ï¼Œé€‰å‡ºæˆ‘æ‰€éœ€è¦çš„ä¿¡æ¯ï¼Œä¸¢å¼ƒæ— ç”¨çš„ä¿¡æ¯ã€‚

ä¸‹é¢æˆ‘ä»¬è¿˜æ˜¯ç”¨å®æˆ˜æ¥å­¦ä¹ pandasè¿™ä¸ªåŠŸèƒ½ã€‚

#### 1.5.1 ä»»åŠ¡ä¸€ï¼š æˆ‘ä»¬ä»¥"Age"ä¸ºç­›é€‰æ¡ä»¶ï¼Œæ˜¾ç¤ºå¹´é¾„åœ¨10å²ä»¥ä¸‹çš„ä¹˜å®¢ä¿¡æ¯ã€‚

In [46]:
#åˆ¤æ–­æ¡ä»¶ï¼Œ
df['Age']<10

#ç´¢å¼•ç­›é€‰
df[df['Age']<10].head(3)

-------------------------

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,a
7,7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.075,NaN,S,100
10,10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.700,G6,S,100
16,16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.125,NaN,Q,100

#### 1.5.2 ä»»åŠ¡äºŒï¼š ä»¥"Age"ä¸ºæ¡ä»¶ï¼Œå°†å¹´é¾„åœ¨10å²ä»¥ä¸Šå’Œ50å²ä»¥ä¸‹çš„ä¹˜å®¢ä¿¡æ¯æ˜¾ç¤ºå‡ºæ¥ï¼Œå¹¶å°†è¿™ä¸ªæ•°æ®å‘½åä¸ºmidage

In [48]:
midage=df[(df['Age']>10)&(df['Age']<50)]
midage.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,a
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,100
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,100
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,100
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,100
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,100

ã€æç¤ºã€‘äº†è§£pandasçš„æ¡ä»¶ç­›é€‰æ–¹å¼ä»¥åŠå¦‚ä½•ä½¿ç”¨äº¤é›†å’Œå¹¶é›†æ“ä½œ

#### 1.5.3 ä»»åŠ¡ä¸‰ï¼šå°†midageçš„æ•°æ®ä¸­ç¬¬100è¡Œçš„"Pclass"å’Œ"Sex"çš„æ•°æ®æ˜¾ç¤ºå‡ºæ¥

In [52]:
midage.loc[99,["Pclass","Sex"]]
#è¿™é‡Œçš„99å®é™…ä¸Šæ˜¯ç¬¬100è¡Œ

Pclass         1
Sex       female
Name: 1, dtype: object

In [51]:
midage.loc[[99],["Pclass","Sex"]]

    Pclass   Sex
99       2  male

ã€æç¤ºã€‘åœ¨æŠ½å–æ•°æ®ä¸­ï¼Œæˆ‘ä»¬å¸Œæœ›æ•°æ®çš„ç›¸å¯¹é¡ºåºä¿æŒä¸å˜ï¼Œç”¨ä»€ä¹ˆå‡½æ•°å¯ä»¥è¾¾åˆ°è¿™ä¸ªæ•ˆæœå‘¢ï¼Ÿ

#### 1.5.4 ä»»åŠ¡å››ï¼šä½¿ç”¨locæ–¹æ³•å°†midageçš„æ•°æ®ä¸­ç¬¬100ï¼Œ105ï¼Œ108è¡Œçš„"Pclass"ï¼Œ"Name"å’Œ"Sex"çš„æ•°æ®æ˜¾ç¤ºå‡ºæ¥

In [77]:
###### å†™å…¥ä»£ç 
midage.loc[[99,104,107],["Pclass","Name","Sex"]]

     Pclass                                      Name   Sex
99        2  Navratil, Mr. Michel ("Louis M Hoffman")  male
104       3                           Corn, Mr. Harry  male
107       3                Bengtsson, Mr. John Viktor  male

#### 1.5.5 ä»»åŠ¡äº”ï¼šä½¿ç”¨ilocæ–¹æ³•å°†midageçš„æ•°æ®ä¸­ç¬¬100ï¼Œ105ï¼Œ108è¡Œçš„"Pclass"ï¼Œ"Name"å’Œ"Sex"çš„æ•°æ®æ˜¾ç¤ºå‡ºæ¥

In [76]:
#å†™å…¥ä»£ç 
midage = midage.reset_index(drop=True)
midage.iloc[[99,104,107],[3,4,5]]

     Pclass                                      Name   Sex
99        2  Navratil, Mr. Michel ("Louis M Hoffman")  male
104       3                           Corn, Mr. Harry  male
107       3                Bengtsson, Mr. John Viktor  male

ã€æ€è€ƒã€‘å¯¹æ¯”`iloc`å’Œ`loc`çš„å¼‚åŒ
1.è”ç³»

(1)æ“ä½œå¯¹è±¡ç›¸åŒï¼šlocå’Œilocéƒ½æ˜¯å¯¹DataFrameç±»å‹è¿›è¡Œæ“ä½œï¼›

(2)å®Œæˆç›®çš„ç›¸åŒï¼šäºŒè€…éƒ½æ˜¯ç”¨äºé€‰å–DataFrameä¸­å¯¹åº”è¡Œæˆ–åˆ—ä¸­çš„å…ƒç´ ã€‚
2.åŒºåˆ«

locå’Œilocç´¢å¼•çš„è¡Œåˆ—æ ‡ç­¾ç±»å‹ä¸åŒã€‚

ilocä½¿ç”¨é¡ºåºæ•°å­—æ¥ç´¢å¼•æ•°æ®ï¼Œè€Œä¸èƒ½ä½¿ç”¨å­—ç¬¦å‹çš„æ ‡ç­¾æ¥ç´¢å¼•æ•°æ®ï¼›æ³¨æ„ï¼šè¿™é‡Œçš„é¡ºåºæ•°å­—æ˜¯æŒ‡ä»0å¼€å§‹è®¡æ•°ï¼

locä½¿ç”¨å®é™…è®¾ç½®çš„ç´¢å¼•æ¥ç´¢å¼•æ•°æ®ã€‚ä½†è¡Œåˆ—åä¸ºæ•°å­—æ—¶ï¼Œlocä¹Ÿå¯ä»¥ç´¢å¼•æ•°å­—ï¼Œä½†è¿™é‡Œçš„æ•°å­—ä¸ä¸€å®šä»0å¼€å§‹ç¼–å·ï¼Œæ˜¯å¯¹åº”å…·ä½“è¡Œåˆ—åçš„æ•°å­—ï¼